Client2/web_messages.svclog

<E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2017-10-19T13:15:56.9722353Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{74686c68-3c57-4600-bbbd-f5a4eb25ab74}" /><Execution ProcessName="iisexpress" ProcessID="3940" ThreadID="72" /><Channel/><Computer>NS01012W033</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2017-10-19T15:15:56.9592270+02:00" Source="TransportSend" Type="System.ServiceModel.Dispatcher.OperationFormatter+OperationFormatterMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><Addressing><Action>http://tempuri.org/IEmployeeService/GetEmployee</Action><To>http://localhost:8080/EmplyeeService</To></Addressing><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header><ActivityId CorrelationId="aa0b846f-04f2-4d70-acaa-549be33d647c" xmlns="http://schemas.microsoft.com/2004/09/ServiceModel/Diagnostics">74686c68-3c57-4600-bbbd-f5a4eb25ab74</ActivityId></s:Header><s:Body><GetEmployee xmlns="http://tempuri.org/"><Id>1</Id></GetEmployee></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2017-10-19T13:15:57.0372989Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{74686c68-3c57-4600-bbbd-f5a4eb25ab74}" /><Execution ProcessName="iisexpress" ProcessID="3940" ThreadID="72" /><Channel/><Computer>NS01012W033</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2017-10-19T15:15:57.0357927+02:00" Source="TransportReceive" Type="System.ServiceModel.Channels.BufferedMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><HttpResponse><StatusCode>OK</StatusCode><StatusDescription>OK</StatusDescription><WebHeaders><Content-Length>532</Content-Length><Content-Type>text/xml; charset=utf-8</Content-Type><Date>Thu, 19 Oct 2017 13:15:57 GMT</Date><Server>Microsoft-HTTPAPI/2.0</Server></WebHeaders></HttpResponse><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header></s:Header><s:Body><GetEmployeeResponse xmlns="http://tempuri.org/"><GetEmployeeResult i:type="a:FullTimeEmployee" xmlns:a="http://schemas.datacontract.org/2004/07/EmployeeService" xmlns:i="http://www.w3.org/2001/XMLSchema-instance"><a:DateOfBirth>1983-02-12T00:00:00</a:DateOfBirth><a:Gender>Male</a:Gender><a:Id>1</a:Id><a:Name>Bojan</a:Name><a:Type>FullTimeEmployee</a:Type><a:AnnualSalary>50000</a:AnnualSalary></GetEmployeeResult></GetEmployeeResponse></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2017-10-20T12:30:30.7653334Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{18bc4d58-432d-4b68-ab69-54f23a8eb4b4}" /><Execution ProcessName="iisexpress" ProcessID="4092" ThreadID="8" /><Channel/><Computer>NS01012W033</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2017-10-20T14:30:30.7562714+02:00" Source="TransportSend" Type="System.ServiceModel.Dispatcher.OperationFormatter+OperationFormatterMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><Addressing><Action>http://tempuri.org/IEmployeeService/GetEmployee</Action><To>http://localhost:8080/EmplyeeService</To></Addressing><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header><ActivityId CorrelationId="efc4e578-e156-427b-909c-d09127d6c057" xmlns="http://schemas.microsoft.com/2004/09/ServiceModel/Diagnostics">18bc4d58-432d-4b68-ab69-54f23a8eb4b4</ActivityId></s:Header><s:Body><GetEmployee xmlns="http://tempuri.org/"><Id>1</Id></GetEmployee></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2017-10-20T12:30:31.1801721Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{18bc4d58-432d-4b68-ab69-54f23a8eb4b4}" /><Execution ProcessName="iisexpress" ProcessID="4092" ThreadID="8" /><Channel/><Computer>NS01012W033</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2017-10-20T14:30:31.1801721+02:00" Source="TransportReceive" Type="System.ServiceModel.Channels.BufferedMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><HttpResponse><StatusCode>OK</StatusCode><StatusDescription>OK</StatusDescription><WebHeaders><Content-Length>532</Content-Length><Content-Type>text/xml; charset=utf-8</Content-Type><Date>Fri, 20 Oct 2017 12:30:31 GMT</Date><Server>Microsoft-HTTPAPI/2.0</Server></WebHeaders></HttpResponse><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header></s:Header><s:Body><GetEmployeeResponse xmlns="http://tempuri.org/"><GetEmployeeResult i:type="a:FullTimeEmployee" xmlns:a="http://schemas.datacontract.org/2004/07/EmployeeService" xmlns:i="http://www.w3.org/2001/XMLSchema-instance"><a:DateOfBirth>1983-02-12T00:00:00</a:DateOfBirth><a:Gender>Male</a:Gender><a:Id>1</a:Id><a:Name>Bojan</a:Name><a:Type>FullTimeEmployee</a:Type><a:AnnualSalary>50000</a:AnnualSalary></GetEmployeeResult></GetEmployeeResponse></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent>